{
  "jobs": [
    {
      "posteName": "Full Stack Engineer",
      "companiesName": "Keyrus",
      "startDate": 2021,
      "endDate": 2023,
      "jobDescription": "Working primarily with Orange Africa, I have had the opportunity to collaborate on multiple modules of the Omnis application. Omnis serves as a back-office platform for the management of events and games for OrangeWorking",
      "tasks": [
        "Collaborated with senior consultants (developers, designers, UX designers) and project/product managers in a small, agile team building responsive, cross-browser compatible and scalable web apps. Daily stand-up. Peer reviewing PR. Involved in front-end & back-end. Exposed to UX.",
        "Deliver high-quality, robust production code for a diverse array of projects for clients including iCADE france, Orange, Keyrus Lyon",
        "Continuous refactoring, debugging and bug fixes to ensure high-quality ads service. Optimized startup time by 20%.        "
      ]
    },
    {
      "posteName": "Frontend Developper",
      "companiesName": "ATAYEN",
      "startDate": 2020,
      "endDate": 2021,
      "jobDescription": "Contributed to the development of an advertising application that connects influencers with brands, providing benefits to users directly from the platform through web 3.0 and blockchain technologies. Responsibilities included bug fixing on the frontend, creating new features on the frontend using React, designing pages based on Figma mockups, participating in the creation and deployment of smart contracts using Solidity, and developing DApps, smart contracts, mint pages, and staking pages for NFT projects.Contributed to the development of an advertising application that connects influencers with brands, providing benefits to users directly from the platform through web 3.0 and blockchain technologies. Responsibilities included bug fixing on the frontend, creating new features on the frontend using React, designing pages based on Figma mockups, participating in the creation and deployment of smart contracts using Solidity, and developing DApps, smart contracts, mint pages, and staking pages for NFT projects.",
      "tasks": [
        "Contributing ideas and suggestions during team meetings and delivering updates on schedule for designs and improvements. ",
        "Redesigning websites to improve navigation and visual appeal.",
        "Participation in the creation and deployment of smart contracts with Solidity.",
        "Design and developed different admin and front-end section of the application that provided a gateway to members to interact with each other as well as customer support."
      ]
    },

    {
      "posteName": "Frontend Developper",
      "companiesName": "Mdsoft   ",
      "startDate": 2019,
      "endDate": 2017,
      "jobDescription": "Creation of web pages based on web design mockups, utilizing HTML/CSS/JS, Bootstrap to define style sheets, menus, footers, and page content, along with SEO optimizations. Development of web pages from a sketch using Bootstrap. Preparation of requirement specification documents. Analysis and SEO referencing of websites. Testing of web and mobile applications prior to deployment.",
      "tasks": [
        "Creating pages web from sketch with bootstrap.   ",
        "Test of application before releases.  ",
        "Loads specifications."
      ]
    }
  ]
}
